In [ ]:
import pandas as pd

# Import temperature data

In [ ]:
df = pd.read_csv("C:\SS\Projects\TimeSeries\data\hr_temp_20170201-20200131_subset.csv")

# exploring the data

In [4]:
df.describe()

            STATION        SOURCE  HourlyDryBulbTemperature
count  2.628000e+04  26280.000000              26243.000000
mean   7.252051e+10      6.971689                 52.964410
std    0.000000e+00      0.226900                 18.911892
min    7.252051e+10      4.000000                 -5.000000
25%    7.252051e+10      7.000000                 37.000000
50%    7.252051e+10      7.000000                 55.000000
75%    7.252051e+10      7.000000                 69.000000
max    7.252051e+10      7.000000                 92.000000

In [26]:
df.count()

date       26280
temp       26243
hour       26280
weekday    26280
month      26280
year       26280
dtype: int64

# clean up dataframe

In [6]:
df.drop(['STATION','REPORT_TYPE','SOURCE'], inplace=True, axis=1)

In [12]:
df = df.rename(columns = {'DATE': 'date', 'HourlyDryBulbTemperature': 'temp'}, inplace = False)

# convert date to datetime64

In [18]:
df['date'] = pd.to_datetime(df["date"])

In [25]:
df.dtypes

date       datetime64[ns]
temp              float64
hour                int64
weekday             int64
month               int64
year                int64
dtype: object

# add additional columns

In [20]:
df['hour'] = df['date'].dt.hour

In [21]:
df['weekday'] = df['date'].dt.dayofweek

In [22]:
df['month'] = df['date'].dt.month

In [23]:
df['year'] = df['date'].dt.year

In [24]:
df.head()

                 date  temp  hour  weekday  month  year
0 2017-02-01 00:53:00  37.0     0        2      2  2017
1 2017-02-01 01:53:00  37.0     1        2      2  2017
2 2017-02-01 02:53:00  36.0     2        2      2  2017
3 2017-02-01 03:53:00  36.0     3        2      2  2017
4 2017-02-01 04:53:00  36.0     4        2      2  2017

# checking for NaN values in temp

In [ ]:
bool_series = pd.isnull(df['temp'])

In [33]:
df[bool_series]

                     date  temp  hour  weekday  month  year
15156 2018-10-25 12:53:00   NaN    12        3     10  2018
16610 2018-12-25 02:53:00   NaN     2        1     12  2018
16611 2018-12-25 03:53:00   NaN     3        1     12  2018
16612 2018-12-25 04:53:00   NaN     4        1     12  2018
16613 2018-12-25 05:53:00   NaN     5        1     12  2018
16614 2018-12-25 06:53:00   NaN     6        1     12  2018
16615 2018-12-25 07:53:00   NaN     7        1     12  2018
16616 2018-12-25 08:53:00   NaN     8        1     12  2018
16617 2018-12-25 09:53:00   NaN     9        1     12  2018
16618 2018-12-25 10:53:00   NaN    10        1     12  2018
16619 2018-12-25 11:53:00   NaN    11        1     12  2018
16620 2018-12-25 12:53:00   NaN    12        1     12  2018
16621 2018-12-25 13:53:00   NaN    13        1     12  2018
16622 2018-12-25 14:53:00   NaN    14        1     12  2018
16623 2018-12-25 15:53:00   NaN    15        1     12  2018
16624 2018-12-25 16:53:00   NaN    16        1     12  2018
16625 2018-12-25 17:53:00   NaN    17        1     12  2018
16626 2018-12-25 18:53:00   NaN    18        1     12  2018
16627 2018-12-25 19:53:00   NaN    19        1     12  2018
16628 2018-12-25 20:53:00   NaN    20        1     12  2018
16629 2018-12-25 21:53:00   NaN    21        1     12  2018
16630 2018-12-25 22:53:00   NaN    22        1     12  2018
16631 2018-12-25 23:53:00   NaN    23        1     12  2018
16632 2018-12-26 00:53:00   NaN     0        2     12  2018
16633 2018-12-26 01:53:00   NaN     1        2     12  2018
16634 2018-12-26 02:53:00   NaN     2        2     12  2018
16635 2018-12-26 03:53:00   NaN     3        2     12  2018
16636 2018-12-26 04:53:00   NaN     4        2     12  2018
16637 2018-12-26 05:53:00   NaN     5        2     12  2018
16640 2018-12-26 08:53:00   NaN     8        2     12  2018
16641 2018-12-26 09:53:00   NaN     9        2     12  2018
16642 2018-12-26 10:53:00   NaN    10        2     12  2018
16643 2018-12-26 11:53:00   NaN    11        2     12  2018
20257 2019-05-26 01:53:00   NaN     1        6      5  2019
20258 2019-05-26 02:53:00   NaN     2        6      5  2019
20259 2019-05-26 03:53:00   NaN     3        6      5  2019
20263 2019-05-26 07:53:00   NaN     7        6      5  2019

In [34]:
df[bool_series].count()

date       37
temp        0
hour       37
weekday    37
month      37
year       37
dtype: int64

# to interpolate the missing values

In [42]:
df = df.interpolate(method ='linear', limit_direction ='forward')

# checking the interpolation results

In [43]:
bool_series = pd.isnull(df['temp'])

In [45]:
df[bool_series].count()

date       0
temp       0
hour       0
weekday    0
month      0
year       0
dtype: int64

In [46]:
df.count()

date       26280
temp       26280
hour       26280
weekday    26280
month      26280
year       26280
dtype: int64

# reading the energy data

In [47]:
pw = pd.read_csv("C:\SS\Projects\TimeSeries\data\hrl_load_metered - 20170201-20200131.csv")

In [48]:
pw.head()

,datetime_beginning_utc,datetime_beginning_ept,nerc_region,mkt_region,zone,load_area,mw,is_verified
0,2/1/2017 5:00,2/1/2017 0:00,RFC,WEST,DUQ,DUQ,1419.881,True
1,2/1/2017 6:00,2/1/2017 1:00,RFC,WEST,DUQ,DUQ,1379.505,True
2,2/1/2017 7:00,2/1/2017 2:00,RFC,WEST,DUQ,DUQ,1366.106,True
3,2/1/2017 8:00,2/1/2017 3:00,RFC,WEST,DUQ,DUQ,1364.453,True
4,2/1/2017 9:00,2/1/2017 4:00,RFC,WEST,DUQ,DUQ,1391.265,True

# dropping columns

In [49]:
pw.drop(['datetime_beginning_utc','nerc_region','mkt_region','zone','load_area','is_verified'], inplace=True, axis=1)

In [50]:
pw.head()

  datetime_beginning_ept        mw
0          2/1/2017 0:00  1419.881
1          2/1/2017 1:00  1379.505
2          2/1/2017 2:00  1366.106
3          2/1/2017 3:00  1364.453
4          2/1/2017 4:00  1391.265

# checking data types

In [51]:
pw.dtypes

datetime_beginning_ept     object
mw                        float64
dtype: object

In [52]:
pw["datetime_beginning_ept"] = pd.to_datetime(pw["datetime_beginning_ept"])

In [53]:
pw.dtypes

datetime_beginning_ept    datetime64[ns]
mw                               float64
dtype: object

In [54]:
pw.count()

datetime_beginning_ept    26280
mw                        26280
dtype: int64

# preparing the merge - add columns to use as indexes

In [56]:
pw.head()

  datetime_beginning_ept        mw
0    2017-02-01 00:00:00  1419.881
1    2017-02-01 01:00:00  1379.505
2    2017-02-01 02:00:00  1366.106
3    2017-02-01 03:00:00  1364.453
4    2017-02-01 04:00:00  1391.265

In [57]:
pw['pw_date'] = pw['datetime_beginning_ept'].dt.date

In [58]:
pw['pw_hour'] = pw['datetime_beginning_ept'].dt.hour

In [59]:
pw.head()

  datetime_beginning_ept        mw     pw_date  pw_hour
0    2017-02-01 00:00:00  1419.881  2017-02-01        0
1    2017-02-01 01:00:00  1379.505  2017-02-01        1
2    2017-02-01 02:00:00  1366.106  2017-02-01        2
3    2017-02-01 03:00:00  1364.453  2017-02-01        3
4    2017-02-01 04:00:00  1391.265  2017-02-01        4

In [60]:
df.head()

                 date  temp  hour  weekday  month  year
0 2017-02-01 00:53:00  37.0     0        2      2  2017
1 2017-02-01 01:53:00  37.0     1        2      2  2017
2 2017-02-01 02:53:00  36.0     2        2      2  2017
3 2017-02-01 03:53:00  36.0     3        2      2  2017
4 2017-02-01 04:53:00  36.0     4        2      2  2017

In [61]:
df['df_date'] = df['date'].dt.date

In [62]:
df.head()

                 date  temp  hour  weekday  month  year     df_date
0 2017-02-01 00:53:00  37.0     0        2      2  2017  2017-02-01
1 2017-02-01 01:53:00  37.0     1        2      2  2017  2017-02-01
2 2017-02-01 02:53:00  36.0     2        2      2  2017  2017-02-01
3 2017-02-01 03:53:00  36.0     3        2      2  2017  2017-02-01
4 2017-02-01 04:53:00  36.0     4        2      2  2017  2017-02-01

In [63]:
df = df.merge(pw, how = "left", left_on = ["df_date","hour"], right_on = ["pw_date","pw_hour"])

In [67]:
df.drop(['df_date','datetime_beginning_ept','pw_date','pw_hour'], inplace=True, axis=1)

In [69]:
df

                     date  temp  hour  weekday  month  year        mw
0     2017-02-01 00:53:00  37.0     0        2      2  2017  1419.881
1     2017-02-01 01:53:00  37.0     1        2      2  2017  1379.505
2     2017-02-01 02:53:00  36.0     2        2      2  2017  1366.106
3     2017-02-01 03:53:00  36.0     3        2      2  2017  1364.453
4     2017-02-01 04:53:00  36.0     4        2      2  2017  1391.265
...                   ...   ...   ...      ...    ...   ...       ...
26278 2020-01-31 19:53:00  34.0    19        4      1  2020  1618.484
26279 2020-01-31 20:53:00  33.0    20        4      1  2020  1580.925
26280 2020-01-31 21:53:00  33.0    21        4      1  2020  1545.354
26281 2020-01-31 22:53:00  33.0    22        4      1  2020  1478.832
26282 2020-01-31 23:53:00  34.0    23        4      1  2020  1405.188

[26283 rows x 7 columns]

# checking NaN values for energy

In [70]:
bool_series = pd.isnull(df['mw'])

In [71]:
df[bool_series]

                     date  temp  hour  weekday  month  year  mw
938   2017-03-12 02:53:00  17.0     2        6      3  2017 NaN
9675  2018-03-11 02:53:00  23.0     2        6      3  2018 NaN
18412 2019-03-10 02:53:00  46.0     2        6      3  2019 NaN

In [72]:
df = df.interpolate(method ='linear', limit_direction ='forward')

In [73]:
bool_series = pd.isnull(df['mw'])

In [75]:
df[bool_series].count()

date       0
temp       0
hour       0
weekday    0
month      0
year       0
mw         0
dtype: int64

# create train and test datasets

In [105]:
train = df[(df['date']>= "2017-02-01") & (df['date']< "2020-01-01")]

In [107]:
test = df[(df['date']>= "2020-01-01")]

In [106]:
train.count()

date       25539
temp       25539
hour       25539
weekday    25539
month      25539
year       25539
mw         25539
dtype: int64

In [108]:
test.count()

date       744
temp       744
hour       744
weekday    744
month      744
year       744
mw         744
dtype: int64

In [109]:
train.head(1)

                 date  temp  hour  weekday  month  year        mw
0 2017-02-01 00:53:00  37.0     0        2      2  2017  1419.881

In [110]:
test.head(1)

                     date  temp  hour  weekday  month  year        mw
25539 2020-01-01 00:53:00  31.0     0        2      1  2020  1363.428